# Практическое задание по теме "Указатели и ссылки"

### Задача: "Библиотека обработки данных"
Напишите программу с **тремя функциями**, каждая использует **разный способ передачи**:

1. **`double calculateAverage(int arr[], int size)`**  
   → Принимает массив **по указателю** (имя массива = указатель!).  
   → Считает среднее арифметическое элементов.  
   → **Не изменяет** массив.

2. **`void replaceNegative(int& value)`**  
   → Принимает число **по ссылке**.  
   → Если число отрицательное — заменяет его на `0`.

3. **`int countDigits(int number)`**  
   → Принимает число **по значению**.  
   → Считает количество цифр в числе (для `0` вернуть `1`).  
   → **Не изменяет** оригинал!

### Пример использования:
```cpp
#include <iostream>
#include <cmath>
using namespace std;

// Реализации функций здесь

int main() {
    setlocale(LC_ALL,"Rus");
    int data[] = {3, -1, 5, -4, 2};
    int size = 5;

    // 1. Среднее (указатель)
    cout << "Среднее: " << calculateAverage(data, size) << endl; // (3 + 0 + 5 + 0 + 2)/5 = 2

    // 2. Замена негативов (ссылка)
    for (int i = 0; i < size; i++) {
        replaceNegative(data[i]);
    }

    // 3. Цифры в числе (значение)
    int testNum = -123;
    cout << "Цифр в " << testNum << ": " << countDigits(testNum) << endl; // 3
}
```

### Требования к коду:
1. Все функции должны быть реализованы **до `main()`**.
2. В `replaceNegative` проверяйте значение **через ссылку**.
3. В `countDigits` работайте с копией числа (рекомендую через модуль `abs`, из библиотеки `cmath`).

### Пример вывода:
```
Среднее: 2
Цифр в -123: 3
```

---

## Итоги 
- **По значению** - безопасно, но "дорого" для больших данных.
- **По ссылке** - эффективно, но нельзя передать "ничего".
- **По указателю** - гибко (можно `nullptr`), но требует осторожность (утечка памяти).
- **Правило большого пальца:**  
  `const T&` для чтения больших объектов,  
  `T&` для изменения,  
  `T*` когда нужен `nullptr` или арифметика указателей.
